var navData = [{
        "id": 1,
        "name": "第一课"
    },
    {
        "id": 2,
        "name": "第二课"
    },
    {
        "id": 3,
        "name": "第三课"
    },
    {
        "id": 4,
        "name": "第四课"
    },
    {
        "id": 5,
        "name": "第五课"
    },
    {
        "id": 6,
        "name": "第六课"
    },
    {
        "id": 7,
        "name": "第七课"
    },
    {
        "id": 8,
        "name": "第八课"
    },
    {
        "id": 9,
        "name": "第九课"
    },
    {
        "id": 10,
        "name": "第十课"
    }
]